# UpdateLoadSummary Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..UpdateLoadSummary Method
PanelScheduleData Class See Also
---
Update the load summary section
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void UpdateLoadSummary()
```

Visual Basic
---
```text
Public Sub UpdateLoadSummary
```

Visual C++
---
```text
public:
void UpdateLoadSummary()
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace